package com.novg.reportmg;

/**
 * Created by NovgorodskiyAK on 15.01.2016.
 */
public class LimitsInitializer {

    static final String[] CAPTION = {"Телефон", "Сумма", "Лимит в руб.", "Перерасход", "Экономия"};

    static final String[][] MANAGEMENT_SAZ = {
            {"Приемная управляющего директора ОАО \"Саяногорский Алюминиевый Завод\"", "531200000", "73680"},
            {"Приемная управляющего директора ОАО \"Саяногорский Алюминиевый Завод\"", "531200000", "77431"},
            {"Приемная управляющего директора ОАО \"Саяногорский Алюминиевый Завод\"", "531200000", "77843"},
            {"Приемная управляющего директора ОАО \"Саяногорский Алюминиевый Завод\"", "531200000", "21101"},
            {"Приемная управляющего директора ОАО \"Саяногорский Алюминиевый Завод\" (факс)", "531200000", "20266"},
            {"Приемная управляющего директора ОАО \"Саяногорский Алюминиевый Завод\" (факс)", "531200000", "20600"},
            {"Приемная управляющего директора ОАО \"Саяногорский Алюминиевый Завод\" (факс)", "531200000", "77710"},
            {"Приемная управляющего директора ОАО \"Саяногорский Алюминиевый Завод\" (факс)", "531200000", "77989"},
            {"Приемная управляющего директора ОАО \"Саяногорский Алюминиевый Завод\" (факс)", "531200000", "79932"},
            {"Приемная управляющего директора ОАО \"Саяногорский Алюминиевый Завод\" (факс)", "531200000", "79933"},
            {"Приемная управляющего директора ОАО \"Саяногорский Алюминиевый Завод\" (факс)", "531200000", "73905"},
            {"Управляющий директор ОАО \"Саяногорский Алюминиевый Завод\"", "531200000", "77401"},
            {"Управляющий директор ОАО \"Саяногорский Алюминиевый Завод\"", "531200000", "63644"},
            {"Офис управляющего директора ОАО \"Саяногорский Алюминиевый Завод\"", "531200000", "26488"},
            {"ОАО \"ГК-Гладенькая\" Президентский номер", "531200000", "21529"},
            {"Теплоресурс", "531200000", "73872"},
    };

    static final String[][] OTB = {
            {"Специалисты по охране труда", "531200050", "73380"},
    };

    static final String[][] PDO = {
            {"Диспетчер завода", "531200020", "20356"},
            {"Диспетчер завода", "531200020", "73347"},
    };

    static final String[][] LAWYERS = {
            {"Начальник", "531200010", "73368"},
            {"Начальник", "531200010", "77996"},
            {"Директор по правовым вопросам", "531200010", "77423"},
            {"Факс юридического одтела", "531200010", "73611"},
    };

    static final String[][] ELECTROLYSE = {
            {"Директор", "530200000", "73666"},
            {"Приемная факс", "530200000", "79925"},
            {"Менеджер ОРПС", "530200000", "77465"},
    };

    static final String[][] FOUNDRY = {
            {"Директор", "530300000", "77090"},
            {"Приемная ЛП (факс)", "530300000", "77372"},
            {"Начальник ОРПС", "530300000", "77830"},
    };

    static final String[][] ELECTRODE = {
            {"Директор", "530100000", "73456"},
    };

    static final String[][] ENERGY = {
            {"Главный энергетик", "531910000", "73570"},
            {"Руководитель группа (ФОРЭМ)", "531910000", "73571"},
            {"Оператор диспетчерской службы (Энергоцех)", "531910000", "73582"},
    };

    static final String[][] ECOLOGY = {
            {"Директор", "530900000", "77856"},
            {"Главный метролог", "530900020", "73040"},
            {"Начальник отдела управления качеством", "531200130", "77117"},
    };

    static final String[][] COMMERCE = {
            {"Коммерческий директор", "530600000", "73287"},
            {"Коммерческий директор", "530600000", "22054"},
            {"Приемная коммерческого директора (факс)", "530600000", "73372"},
            {"Приемная коммерческого директора", "530600000", "73923"},
            {"Начальник  ОООП", "530600030", "73004"},
            {"Специалист ОООП", "530600030", "73167"},
            {"Начальник ОМТС", "530600010", "73267"},
            {"Факс ОМТС", "530600010", "73321"},
            {"Специалист ОМТС", "530600010", "73006"},
            {"Менеджер ОМТС", "530600010", "73317"},
            {"Специалист ОМТС", "530600010", "73822"},
            {"Специалист ОМТС", "530600010", "73027"},
            {"Менеджер ОМТС", "530600010", "73828"},
            {"ОМТС", "530600010", "73512"},
            {"Менеджер ОМТС", "530600010", "73831"},
            {"Специалист ОМТС", "530600010", "77555"},
            {"Менеджер ОМТС", "530600010", "73704"},
            {"Начальник отдела таможенного оформления", "530600020", "73237"},
            {"Таможня", "530600040", "77154"},
            {"Начальника транспортного отдела", "530600040", "73966"},
            {"Менеджер транспортного отдела", "530600040", "73318"},
            {"Начальник ЖДЦ", "530601000", "73211"},
            {"ЖДЦ (ст. Алюминиевая)", "530601000", "73961"},
            {"ЖДЦ (Товарный кассир филиала ст. Камышта)", "530601000", "77296"},
    };

    static final String[][] PERSONNEL = {
            {"Директор по персоналу", "530700000", "77552"},
            {"Приемная директора по персоналу (факс)", "530700000", "73441"},
            {"Приемная директора по персоналу", "530700000", "77991"},
            {"Руководитель проекта \"Профессионалы РУСАЛа\"", "530700090", "73903"},
            {"Начальник ООК", "530701000", "79945"},
            {"Специалист ОР и ПП", "530700030", "77765"},
            {"ФОК 10мкр", "530702000", "23122"},
            {"ФОК 10мкр", "530702000", "26138"},
            {"АДМИНИСТРАТИВНО-ХОЗЯЙСТВЕННЫЙ ОТДЕЛ", "", ""},
            {"АХО", "530700070", "73238"},
    };

    static final String[][] FINANCE = {
            {"Финансовый директор", "530800000", "73810"},
            {"Приемная финансового директора (факс)", "530800000", "73801"},
            {"Приемная финансового директора", "530800000", "77988"},
            {"Финансовый директор", "530800000", "26092"},
            {"Менеджер ПБО", "530800010", "77168"},
            {"Главный бухгалтер", "530800030", "73320"},
            {"Аудиторы", "530800030", "73038"},
            {"Аудиторы", "530800030", "73602"},
            {"Аудиторы", "530800030", "77197"},
            {"Аудиторы", "530800030", "77331"},
            {"Аудиторы", "530800030", "73263"},
            {"ОУСиКО", "530800050", "77269"},
    };

    static final String[][] SECURITY = {
            {"Директор по защите ресурсов", "531100000", "73950"},
            {"Приемная начальника СЗЭР (факс)", "531100010", "73107"},
            {"Гараж ДИСа", "531100050", "63445"},
            {"СЛУЖБА ЗАЩИТЫ ЭКОНОМИЧЕСКИХ РЕСУРСОВ", "", ""},
            {"", "531100020", "73531"},
            {"", "531100010", "73684"},
            {"Начальник СЗЭР", "531100010", "73180"},
            {"", "531100010", "23133"},
            {"Начальник отдела режима и охраны", "531100010", "73522"},
            {"Охрана ДИСа", "531100010", "23144"},
            {"Менеджер СЗЭР", "531100010", "73960"},
            {"Менеджер СЗЭР", "531100010", "77981"},
            {"Менеджер СЗЭР", "531100010", "77867"},
            {"Менеджер СЗЭР", "531100010", "77121"},
            {"Менеджер СЗЭР", "531100010", "73068"},
            {"Менеджер СЗЭР", "531100010", "73068"},
            {"Менеджер СЗЭР", "531100010", "73068"},
            {"Менеджер СЗЭР", "531100010", "73068"},
            {"Менеджер СЗЭР", "531100010", "77531"},
            {"ПЕРВЫЙ ОТДЕЛ, ШТАБ ГОиЧС", "", ""},
            {"Начальник", "531100030", "73901"},
            {"Специалист", "531100030", "73371"},
    };

    static final String[][] TRADE_UNION = {
            {"Приемная профкома ОАО \"САЗ\"", "531300020", "73050"},
    };

    static final String[][] PRESS_SERVICE = {
            {"Руководитель пресс-службы", "531200040", "73790"},
            {"ЦСП РУСАЛа", "531200040", "62267"},
            {"Специалист пресс-службы", "531200040", "77405"},
    };

    static final String[][] VETERAN_UNION = {
            {"Председатель союза ветеранов", "", "20673"},
    };

    static final String[][] DIS = {
            {"Кв. № 94", "531300050", "21956"},
            {"Кв.№101 Президентский номер", "531300040", "22800"},
            {"Кв.№ 94", "531300050", "23510"},
    };

    static final String[][] OTHER = {
            {"Кв. Гаманович Г.Г.", "", "73820"},
            {"Кв. Гаманович Г.Г. (Internet)", "", "73820"},
            {"ЗАО \"Смена плюс\" Специалист по кадрам", "", "73881"},
            {"Абакан", "", "243777"},
    };
}
